# x1 = int(input())  # столбец первой клетки
# y1 = int(input())  # строка первой клетки
# x2 = int(input())  # столбец второй клетки
# y2 = int(input())  # строка второй клетки
#
# if (x1 + y1 + x2 + y2) % 2 != 0 and x1 != x2 and y1 != y2:
#     print('YES')
# else:
#     print('NO')
#
# # "Если сумма всех значений нечетная и первое значение не равно третьей и второе значение не равно четвертой то напечатать 'ДА' иначе 'НЕТ'.

a, b = float(input()), float(input())

if a > b:
    print(a)
else:
    print(b)
