'''Напишите проект "Калькулятор".
Инструкции к заданию:
Напишите скрипт "калькулятор", который будет принимать от пользователя на вход:
1-е число
арифметический знак, один из: +, -, *, /
2-е число
производить сложение, вычитание, умножение или деление, в зависимости от введенного знака
А так же предусмотрите проверку на то, что на ноль делить нельзя. И другие виды некорректно введенных данных.
Данное задание Вам необходимо выполнить самостоятельно и не пользоваться сторонними источниками
Ответ в виде текста, прошу приложить в Решение
Прошу после выполнения задания рассказывать свои впечатления, при желании указывать время на выполнение.
Не прикладывайте, пожалуйста в комментарий решения)
ДРУЗЬЯ, ЕЩЕ РАЗ: КАЛЬКУЛЯТОР ДОЛЖЕН УМЕТЬ СКЛАДЫВАТЬ, ВЫЧИТАТЬ, УМНОЖАТЬ, ДЕЛИТЬ. НЕ ТОЛЬКО ДЕЛИТЬ!!!
ПРИ ЧЕМ ДЕЙСТВИЕ ВЫПОЛНЯЕТСЯ ИСХОДЯ ИЗ ТОГО КАКОЙ ЗНАК ВВЕЛ ПОЛЬЗОВАТЕЛЬ!'''

znal = input('Введите знак действия (+ - * /): ')
def